Revit 2027 API
ViewSheetSetting Class
Represents the View/Sheet Set (Application Menu->Print) within Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ViewSheetSetting
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewSheetSetting : APIObject
Public Class ViewSheetSetting
	Inherits APIObject
public ref class ViewSheetSetting : public APIObject
type ViewSheetSetting =
    class
        inherit APIObject
    end
The ViewSheetSetting type exposes the following members.
Properties
Name | Description
AvailableViews | All views that can be printed.
CurrentViewSheetSet | The current view sheet set of PrintSetup.
InSession | The in-session view sheet set of Print Setup.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Top
Methods
Name | Description
Delete | Delete the current view sheet set, and make the In-Session set as the current one.
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Rename | Rename the current view sheet set.
Revert | Revert the current view sheet set.
Save | Save the changes for the current view sheet set.
SaveAs | Save the current view sheet set to another view sheet set with the specified name.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace